tap "alexstrnik/browserino"
tap "bendews/tap"
tap "buo/cask-upgrade"
tap "hamidnazari/jetbrains-versions"
tap "hashicorp/tap"
tap "lotyp/formulae"
tap "microsoft/mssql-release"
tap "mulesoft-labs/data-weave"
tap "notwadegrimridge/brew"
tap "oktadeveloper/tap"
tap "rcmdnk/file"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Apache ActiveMQ: powerful open source messaging server
brew "activemq", restart_service: :changed
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Simple API client (Postman-like) in your terminal
brew "atac"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# GNU Emacs text editor
brew "emacs"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Framework for layout and rendering of i18n text
brew "pango"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Command-line hex viewer
brew "hexyl"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Extendable open source continuous integration server
brew "jenkins"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Text editor based on the POSIX standard
brew "ne"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Command-line collection runner for Postman
brew "newman"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Development kit for the Java programming language
brew "openjdk@17"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Presenter console with multi-monitor support for PDF files
brew "pdfpc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Shortcut for the 'ps aux | grep' idiom
brew "psgrep"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Fully featured SFTP server with optional HTTP/S, FTP/S and WebDAV support
brew "sftpgo", restart_service: :changed
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Soak up standard input and write to a file
brew "sponge"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Unicode database query tool for the command-line
brew "uni"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Fetch summaries from MediaWiki wikis, like Wikipedia
brew "wiki"
# Access X11 clipboards from the command-line
brew "xclip"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Eclipse-based IDE for designing and testing Mule applications
cask "anypointstudio"
# User-friendly GUI app for Homebrew
cask "applite"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Visualise and analyse Claude Code session executions
cask "claude-devtools"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack"
cask "font-symbols-only-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@canary"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Find shortcuts for any installed application
cask "keyclu"
# Host-based application firewall
cask "little-snitch"
# Clipboard manager
cask "maccy"
# Extensible two-pane file manager
cask "marta"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Command palette in any application
cask "paletro"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# API testing tool
cask "soapui"
# Music streaming service
cask "spotify"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Menu bar pomodoro timer
cask "tomatobar"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# OpenJDK distribution from Azul
cask "zulu@8"
mas "Acidity", id: 6472630023
mas "Acorn", id: 6737921844
mas "Actions For Obsidian", id: 1659667937
mas "Anybox", id: 1593408455
mas "BBEdit", id: 404009241
mas "Bitwarden", id: 1352778147
mas "Data Jar", id: 1453273600
mas "DetailsPro", id: 1524366536
mas "DuckDuckGo", id: 663592361
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Fantastical", id: 975937182
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "Ground News", id: 1324203419
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Instapaper Save", id: 1481302432
mas "InYourFace", id: 1476964367
mas "Kagi for Safari", id: 1622835804
mas "Keeper for Safari", id: 6444685332
mas "Keeper Password Manager", id: 414781829
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Night Eye", id: 1450504903
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "One Markdown", id: 1507139439
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "postStack", id: 957134711
mas "quickgif", id: 6744745027
mas "Raycast Companion", id: 6738274497
mas "Shareful", id: 1522267256
mas "Simplenote", id: 692867256
mas "SingleFile", id: 6444322545
mas "Super Agent", id: 1568262835
mas "uBlock Origin Lite", id: 6745342698
mas "Universal Print", id: 6450432292
mas "UnTrap", id: 1637438059
mas "Wayback Machine", id: 1472432422
mas "Week Number", id: 6502579523
mas "Windows App", id: 1295203466
mas "World Clock", id: 956377119
mas "Xcode", id: 497799835
vscode "adamhartford.vscode-base64"
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "arthurspark.vs-code-ext-mule-munit-helper"
vscode "block.vscode-mcp-extension"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "edgarmoran.anypoint-monitor"
vscode "esbenp.prettier-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jebbs.plantuml"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "mekusuri.jsonl-tool"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "netcorext.uuid-generator"
vscode "nhoizey.gremlins"
vscode "nicolaiverbaarschot.alabaster-variant-theme"
vscode "openai.chatgpt"
vscode "petli-full.json-to-yaml-and-more"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "rlivings39.fzf-quick-open"
vscode "salesforce.mule-dx-api-component"
vscode "salesforce.mule-dx-apikit-component"
vscode "salesforce.mule-dx-data-weave-client"
vscode "salesforce.mule-dx-dependencies"
vscode "salesforce.mule-dx-extension-pack"
vscode "salesforce.mule-dx-mule-dev-component"
vscode "salesforce.mule-dx-munit-component"
vscode "salesforce.mule-dx-runtime"
vscode "salesforce.mule-dx-vscode"
vscode "sharat.vscode-brewfile"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "thedangander.jsonl-lab"
vscode "upstash.context7-mcp"
vscode "voidei.vscode-vimrc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
cargo "cargo-cache"
cargo "cargo-update"
cargo "jless"
npm "@anthropic-ai/claude-code"
npm "@github/copilot"
npm "@nestjs/cli"
npm "@vue/cli-init"
npm "@vue/cli"
npm "anypoint-cli-v4-public"
npm "anypoint-cli-v4"
npm "newman-reporter-htmlextra"
