# core/dotfiles
brew "bats-core"
brew "stow"
brew "grep"

# existing
brew "activemq"
brew "aichat"
brew "aom"
brew "aribb24"
brew "asdf"
brew "atuin"
brew "bash"
brew "bat"
brew "bats-core"
brew "bdw-gc"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cjson"
brew "coreutils"
brew "croc"
brew "curl"
brew "dav1d"
brew "dockutil"
brew "duti"
brew "emacs"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "flac"
brew "fontconfig"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gawk"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glib"
brew "glow"
brew "gmp"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "gpgme"
brew "graphite2"
brew "grep"
brew "grip"
brew "harfbuzz"
brew "hexyl"
brew "highway"
brew "httpie"
brew "icu4c@76"
brew "icu4c@77"
brew "imagemagick"
brew "imath"
brew "jansson"
brew "jasper"
brew "java-service-wrapper"
brew "jbig2dec"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgit2@1.8"
brew "libgpg-error"
brew "libheif"
brew "libice"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmicrohttpd"
brew "libnghttp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libraw"
brew "librist"
brew "libsamplerate"
brew "libsm"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtommath"
brew "libtool"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxmu"
brew "libxrender"
brew "libxt"
brew "libyaml"
brew "little-cms2"
brew "llvm"
brew "lynx"
brew "lz4"
brew "lzo"
brew "m4"
brew "maven"
brew "mbedtls"
brew "mise"
brew "mpdecimal"
brew "mpfr"
brew "mpg123"
brew "n"
brew "nano"
brew "ncurses"
brew "ne"
brew "nettle"
brew "newman"
brew "node"
brew "node@20"
brew "npth"
brew "nspr"
brew "nss"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre"
brew "pcre2"
brew "pinentry"
brew "pipx"
brew "pixman"
brew "pkgconf"
brew "poppler"
brew "psgrep"
brew "python-packaging"
brew "python-tk@3.12"
brew "python@3.12"
brew "python@3.13"
brew "rav1e"
brew "readline"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "rust"
brew "sdl2"
brew "sevenzip"
brew "shared-mime-info"
brew "shellcheck"
brew "sl"
brew "snappy"
brew "speex"
brew "sqlite"
brew "srt"
brew "ssh-copy-id"
brew "stow"
brew "superfile"
brew "svt-av1"
brew "tcl-tk"
brew "tesseract"
brew "the_silver_searcher"
brew "thefuck"
brew "theora"
brew "tmux"
brew "topgrade"
brew "tree"
brew "tree-sitter"
brew "unar"
brew "unbound"
brew "uni"
brew "usage"
brew "utf8proc"
brew "w3m"
brew "webp"
brew "wget"
brew "wiki"
brew "x264"
brew "x265"
brew "xclip"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yazi"
brew "z3"
brew "zeromq"
brew "zimg"
brew "zoxide"
brew "zstd"
brew "firefox"
brew "font-fira-code"
brew "font-hack"
brew "font-symbols-only-nerd-font"
brew "fork"
brew "google-chrome"
brew "google-chrome@canary"
brew "maccy"
brew "marta"
brew "meld"
brew "okta"
brew "proton-drive"
brew "raycast"
brew "shottr"
brew "slack"
brew "spotify"
brew "visual-studio-code"
brew "vlc"
brew "warp"
