tap "homebrew/bundle"
tap "lotyp/homebrew-formulae"

# core/dotfiles
brew "bats-core"
brew "coreutils"
brew "duti"
brew "lotyp/formulae/dockutil"
brew "nano"
brew "stow"
brew "tmux"
brew "topgrade"

# fs/network
brew "bat"
brew "tree"
brew "wget"

# search/grep/diff
brew "fzf"
brew "grep"
brew "jq"

# languages/tools
brew "gh"
brew "n"
brew "python"

# media
brew "ffmpeg"
brew "imagemagick"
brew "webp"